{
	"metadata": {
		"name": "40 Hadith Qudsi",
		"section": {
			"1": "40 Hadith Qudsi"
		},
		"section_detail": {
			"1": {
				"hadithnumber_first": 1,
				"hadithnumber_last": 40,
				"arabicnumber_first": 1,
				"arabicnumber_last": 40
			}
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1,
			"arabicnumber": 1,
			"text": "Theo lời kể của Abu Hurayrah (cầu xin Allah hài lòng về họ), Thiên Sứ của Allah (ﷺ) nói: 'Khi Allah định đoạt việc Tạo Dựng, Ngài đã tự cam kết bằng cách ghi vào Sổ của Ngài, vốn được đặt cạnh Ngài: **'Lòng Thương Xót của TA vượt trên Sự Phẫn Nộ của TA.'**'\nDo Muslim ghi lại (cũng như Al-Bukhari, An-Nasa'i và Ibn Majah).",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2,
			"arabicnumber": 2,
			"text": "Theo lời kể của Abu Hurayrah (cầu xin Allah hài lòng về họ), Thiên Sứ của Allah (ﷺ) nói: 'Allah Toàn Năng phán: **'Con cháu Adam đã phủ nhận TA dù y không có quyền làm thế. Và y đã xúc phạm TA dù y không có quyền làm thế. Về việc y phủ nhận TA, đó là khi y nói: 'Ngài sẽ không tái tạo tôi như cách Ngài đã tạo ra tôi lúc ban đầu' – trong khi việc tạo dựng lần đầu không hề dễ dàng hơn đối với TA so với việc tái tạo y. Còn về việc y xúc phạm TA, đó là khi y nói: 'Allah đã có một người con', trong khi TA là Đấng Duy Nhất, Đấng Vĩnh Cửu mà vạn vật nương tựa. TA không sinh ra ai, cũng không do ai sinh ra, và không một ai đồng đẳng với TA.'**'\nDo Al-Bukhari ghi lại (cũng như An-Nasa'i).",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3,
			"arabicnumber": 3,
			"text": "Theo lời kể của Zayd ibn Khalid al-Juhaniyy (cầu xin Allah hài lòng về họ), họ nói: 'Thiên Sứ của Allah (ﷺ) đã hướng dẫn lễ nguyện buổi sáng cho chúng tôi tại Al-Hudaybiyah sau một đêm mưa. Khi đã xong, Người quay về phía mọi người và phán: 'Các ngươi có biết Thượng Đế của các ngươi nói điều gì không?' Họ đáp: 'Allah và Thiên Sứ của Ngài biết rõ nhất.' Người phán: **'Sáng nay, một trong số bầy tôi của TA đã trở thành người có đức tin nơi TA và một kẻ khác lại trở thành kẻ vô đức tin. Ai nói: 'Chúng ta được ban mưa bởi Ân huệ và Lòng thương xót của Allah', thì người đó là người có đức tin nơi TA, và vô đức tin nơi các vì sao¹. Còn ai nói: 'Chúng ta được ban mưa nhờ sao này, sao kia', thì người đó là kẻ vô đức tin nơi TA, và có đức tin nơi các vì sao.'**'\n(1) Người Arab thời tiền Islam tin rằng mưa được tạo ra bởi sự chuyển động của các vì sao. Hadith này nhấn mạnh rằng dù nguyên nhân trực tiếp của các hiện tượng tự nhiên là gì, thì Allah Toàn Năng mới là Đấng định đoạt mọi sự.\nDo Al-Bukhari ghi lại (cũng như Malik và An-Nasa'i).",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4,
			"arabicnumber": 4,
			"text": "Theo lời kể của Abu Hurayrah (cầu xin Allah hài lòng về họ), Thiên Sứ của Allah (ﷺ) nói: 'Allah phán: **'Con cháu Adam mạ lỵ Thời Gian, trong khi TA chính là Thời Gian¹, trong Tay TA là đêm và ngày.'**'\n(1) Vì Đấng Toàn Năng là Đấng Sắp Đặt mọi sự, việc mạ lỵ những điều không may xảy ra trong dòng Thời Gian cũng tương đương với việc mạ lỵ chính Ngài.\nDo Al-Bukhari ghi lại (cũng như Muslim).",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5,
			"arabicnumber": 5,
			"text": "Theo lời kể của Abu Hurayrah (cầu xin Allah hài lòng về họ), Thiên Sứ của Allah (ﷺ) nói: 'Allah (Đấng Vinh Quang và Tối Cao) phán: **'TA tự đầy đủ đến mức không cần bất kỳ sự hợp tác nào. Do đó, ai làm một việc gì đó vừa vì TA lại vừa vì một ai khác, TA sẽ từ bỏ hành động đó của y cho kẻ mà y đã liên kết với TA.'**'\nDo Muslim ghi lại (cũng như Ibn Majah).",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6,
			"arabicnumber": 6,
			"text": "Theo lời kể của Abu Hurayrah (cầu xin Allah hài lòng về họ), họ nói: Tôi đã nghe Thiên Sứ của Allah (ﷺ) nói: 'Vào Ngày Phán Xét, người đầu tiên bị xét xử sẽ là một người đã tử vì đạo. Y sẽ được đưa đến, và Allah sẽ cho y thấy những ân huệ Ngài đã ban, và y sẽ nhận ra chúng. [Đấng Toàn Năng] sẽ phán: **'Ngươi đã làm gì với chúng?'** Y sẽ đáp: 'Bề tôi đã chiến đấu vì Ngài cho đến khi tử vì đạo.' Ngài sẽ phán: **'Ngươi đã nói dối - ngươi chỉ chiến đấu để được gọi là 'dũng cảm'. Và người ta đã nói như vậy.'** Sau đó, lệnh được ban ra và y bị kéo lê bằng mặt xuống đất cho đến khi bị ném vào Hỏa Ngục. [Người khác] sẽ là một người đã học và dạy kiến thức tôn giáo và thường xuyên đọc Qur'an. Y sẽ được đưa đến, và Allah sẽ cho y thấy những ân huệ của Ngài, và y sẽ nhận ra chúng. [Đấng Toàn Năng] sẽ phán: **'Ngươi đã làm gì với chúng?'** Y sẽ đáp: 'Bề tôi đã học và dạy kiến thức, và đã đọc Qur'an vì Ngài.' Ngài sẽ phán: **'Ngươi đã nói dối - ngươi chỉ học để được gọi là 'học giả', và ngươi đọc Qur'an để được gọi là 'người ngâm đọc'. Và người ta đã nói như vậy.'** Sau đó, lệnh được ban ra và y bị kéo lê bằng mặt xuống đất cho đến khi bị ném vào Hỏa Ngục. [Người nữa] sẽ là một người được Allah ban cho sự giàu có và đủ loại của cải. Y sẽ được đưa đến, và Allah sẽ cho y thấy những ân huệ của Ngài, và y sẽ nhận ra chúng. [Đấng Toàn Năng] sẽ phán: **'Ngươi đã làm gì với chúng?'** Y sẽ đáp: 'Bề tôi đã không bỏ qua con đường nào mà Ngài muốn tiền bạc được chi tiêu mà không chi tiêu trên đó vì Ngài.' Ngài sẽ phán: **'Ngươi đã nói dối - ngươi chỉ làm vậy để được gọi là 'hào phóng'. Và người ta đã nói như vậy.'** Sau đó, lệnh được ban ra và y bị kéo lê bằng mặt xuống đất rồi bị ném vào Hỏa Ngục.'\nDo Muslim ghi lại (cũng như At-Tirmidhi và An-Nasa'i).",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7,
			"arabicnumber": 7,
			"text": "Theo lời kể của Uqbah ibn Amir (cầu xin Allah hài lòng về họ), họ nói: Tôi đã nghe Thiên Sứ của Allah (ﷺ) nói: 'Thượng Đế của ngươi lấy làm hài lòng về một người chăn cừu, trên đỉnh một vách núi, đã gọi lời kêu gọi Adhan và thực hiện lễ nguyện. Sau đó, Allah (Đấng Vinh Quang và Tối Cao) phán: **'Hãy nhìn vào người bầy tôi này của TA, y gọi Adhan và thực hiện lễ nguyện; y kính sợ TA. TA đã tha thứ cho bầy tôi của TA [tội lỗi của y] và đã cho y vào Thiên Đàng.'**'\nDo An-Nasa'i ghi lại với một chuỗi truyền tin tốt.",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 8,
			"arabicnumber": 8,
			"text": "Theo lời kể của Abu Hurayrah (cầu xin Allah hài lòng về họ), từ Nabi (ﷺ), Người nói: 'Một lễ nguyện được thực hiện bởi người không đọc Chương Mở Đầu Kinh Qur'an (Surat al-Fatihah) trong đó là thiếu sót (Người lặp lại ba lần), không hoàn chỉnh.' Có người hỏi Abu Hurayrah: '[Ngay cả khi] chúng tôi đứng sau imam?' Họ đáp: 'Hãy đọc thầm, vì tôi đã nghe Nabi (ﷺ) nói: Allah (Đấng Quyền Năng và Tối Cao) nói: **'TA đã chia lễ nguyện thành hai nửa giữa TA và bầy tôi của TA, và bầy tôi của TA sẽ nhận được điều y cầu xin.'** Khi người bầy tôi nói: *'Al-hamdu lillahi rabbil-’alamin’* (Mọi lời ca ngợi đều dâng lên Allah, Thượng Đế của vũ trụ và vạn vật), Allah phán: **'Bầy tôi của TA đã ca ngợi TA.'** Và khi y nói: *'Ar-rahmani r-rahim'* (Đấng Rất Mực Độ Lượng, Đấng Rất Mực Khoan Dung), Allah phán: **'Bầy tôi của TA đã tán dương TA.'** Và khi y nói: *'Maliki yawmi d-din'* (Đức Vua của Ngày Phán Xét), Allah phán: **'Bầy tôi của TA đã tôn vinh TA'** – và một lần khác Ngài phán: **'Bầy tôi của TA đã quy phục quyền năng của TA.'** Và khi y nói: *'Iyyaka na’budu wa iyyaka nasta’in'* (Lạy Ngài, bầy tôi chỉ thờ phượng một mình Ngài và chỉ cầu xin sự giúp đỡ từ một mình Ngài), Ngài phán: **'Điều này là giữa TA và bầy tôi của TA, và bầy tôi của TA sẽ nhận được điều y cầu xin.'** Và khi y nói: *'Ihdina s-sirata l-mustaqim, siratal ladhina an’amta alayhim ghayril-maghdubi alayhim wa la d-dallin'* (Xin Ngài hướng dẫn bầy tôi đi theo con đường ngay thẳng, con đường của những người đã được Ngài ban ân, không phải của những kẻ bị Ngài phẫn nộ, cũng không phải của những kẻ lầm lạc), Ngài phán: **'Điều này là dành cho bầy tôi của TA, và bầy tôi của TA sẽ nhận được điều y cầu xin.'**'\nDo Muslim ghi lại (cũng như Malik, At-Tirmidhi, Abu-Dawud, An-Nasa'i và Ibn Majah).",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 9,
			"arabicnumber": 9,
			"text": "Theo lời kể của Abu Hurayrah (cầu xin Allah hài lòng về họ), từ Nabi (ﷺ), Người nói: 'Allah (Đấng Quyền Năng và Tối Cao) phán: **'Hành động đầu tiên của một người bầy tôi của Allah sẽ bị tra hỏi vào Ngày Phán Xét là các lễ nguyện Salah của y. Nếu chúng hoàn chỉnh, y sẽ thành công và thắng lợi; nếu chúng thiếu sót, y sẽ thất bại và thua thiệt. Nếu có điều gì thiếu sót trong các lễ nguyện bắt buộc của y, Thượng Đế (Đấng Vinh Quang và Tối Cao) sẽ phán: 'Hãy xem bầy tôi của TA có lễ nguyện tự nguyện (sunnah) nào không để bù đắp cho những thiếu sót trong các lễ nguyện bắt buộc.' Sau đó, các hành động còn lại của y cũng sẽ được xét xử theo cách tương tự.'**'\nDo At-Tirmidhi ghi lại (cũng như Abu Dawud, An-Nasa'i, Ibn Majah và Ahmad).",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 10,
			"arabicnumber": 10,
			"text": "Theo lời kể của Abu Hurayrah (cầu xin Allah hài lòng về họ), từ Nabi (ﷺ), Người nói: 'Allah (Đấng Quyền Năng và Tối Cao) phán: **'Việc nhịn chay là của TA và chính TA sẽ ban phần thưởng cho nó. [Một người] từ bỏ dục vọng, thức ăn và nước uống vì TA. Nhịn chay là một tấm khiên, và người nhịn chay có hai niềm vui: một niềm vui khi xả chay và một niềm vui khi gặp Thượng Đế của mình. Hơi thở từ miệng người nhịn chay còn tốt hơn trong sự ước lượng của Allah so với mùi xạ hương.'**'\nDo Al-Bukhari ghi lại (cũng như Muslim, Malik, At-Tirmidhi, An-Nasa'i và Ibn Majah).",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 11,
			"arabicnumber": 11,
			"text": "Theo lời kể của Abu Hurayrah (cầu xin Allah hài lòng về họ), từ Nabi (ﷺ), Người nói: 'Allah (Đấng Quyền Năng và Tối Cao) phán: **'Hãy chi dùng (làm từ thiện), hỡi con cháu Adam, và TA sẽ chi dùng cho các ngươi.'**'\nDo Al-Bukhari ghi lại (cũng như Muslim).",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 12,
			"arabicnumber": 12,
			"text": "Theo lời kể của Abu Mas'ud al-Ansari (cầu xin Allah hài lòng về họ), Thiên Sứ của Allah (ﷺ) nói: 'Một người đàn ông từ thời trước các ngươi đã bị tra hỏi. Không có việc tốt nào được tìm thấy nơi y, ngoại trừ việc y thường giao dịch với mọi người và vì là người khá giả, y thường ra lệnh cho những người làm của mình tha nợ cho người đang trong hoàn cảnh khó khăn. Người (Nabi ﷺ) nói rằng Allah nói: **'TA còn xứng đáng hơn ngươi trong việc đó (sự rộng lượng). Hãy tha cho y.'**'\nDo Muslim ghi lại (cũng như Al-Bukhari và An-Nasa'i).",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 13,
			"arabicnumber": 13,
			"text": "Theo lời kể của Adiyy ibn Hatim (cầu xin Allah hài lòng về họ), họ nói: 'Tôi đang ở cùng Thiên Sứ của Allah (ﷺ) thì có hai người đàn ông đến: một người than phiền về sự nghèo túng, người kia than phiền về nạn cướp bóc. Thiên Sứ của Allah (ﷺ) phán: 'Về nạn cướp bóc, sẽ chỉ trong một thời gian ngắn nữa, một đoàn lữ hành sẽ có thể đi từ Makkah mà không cần người bảo vệ. Về sự nghèo túng, Giờ Tận Thế sẽ không đến cho đến khi một trong các ngươi mang của từ thiện đi khắp nơi mà không tìm được ai nhận nó. Sau đó, chắc chắn mỗi người trong các ngươi sẽ đứng trước Allah, không có bức màn che giữa Ngài và y, cũng không có người phiên dịch. Rồi Ngài sẽ phán với y: **'TA đã không ban cho ngươi của cải sao?'** Y sẽ đáp: 'Vâng, lạy Thượng Đế.' Rồi Ngài sẽ phán: **'TA đã không cử một Thiên Sứ đến cho ngươi sao?'** Y sẽ đáp: 'Vâng, lạy Thượng Đế.' Y sẽ nhìn sang bên phải và không thấy gì ngoài Hỏa Ngục, rồi y nhìn sang bên trái và không thấy gì ngoài Hỏa Ngục, vậy hãy để mỗi người trong các ngươi tự bảo vệ mình khỏi Hỏa Ngục, dù chỉ bằng một nửa quả chà là - và nếu không tìm thấy, thì bằng một lời nói tử tế.'\nDo Al-Bukhari ghi lại.",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 14,
			"arabicnumber": 14,
			"text": "Theo lời kể của Abu Hurayrah (cầu xin Allah hài lòng về họ), từ Nabi (ﷺ), Người nói: 'Allah (Đấng Vinh Quang và Tối Cao) có các Thiên Thần đặc biệt đi tuần khắp nơi để tìm kiếm các buổi tụng niệm (Dhikr) tên của Allah: họ ngồi cùng những người tham gia và dùng cánh bao bọc lẫn nhau, lấp đầy khoảng không giữa họ và tầng trời thấp nhất. Khi [những người trong buổi tụng niệm] giải tán, [các Thiên Thần] bay lên trời. Người (Nabi ﷺ) nói: 'Sau đó, Allah (Đấng Quyền Năng và Tối Cao) hỏi họ - [dù] Ngài biết rõ hơn họ: **'Các ngươi từ đâu đến?'** Họ đáp: 'Bầy tôi đến từ những bầy tôi của Ngài trên Trái Đất: họ đang tán vinh Ngài (Subhanallah), ca tụng sự vĩ đại của Ngài (Allahu Akbar), chứng nhận không có Thượng Đế nào ngoài Ngài (La ilaha illallah), ca ngợi Ngài (Alhamdulillah), và cầu xin [ân huệ] từ Ngài.' Ngài phán: **'Họ cầu xin TA điều gì?'** Họ đáp: 'Họ cầu xin Thiên Đàng của Ngài.' Ngài phán: **'Họ đã thấy Thiên Đàng của TA chưa?'** Họ đáp: 'Chưa, lạy Thượng Đế.' Ngài phán: **'Vậy sẽ ra sao nếu họ thấy được Thiên Đàng của TA!'** Họ nói: 'Và họ cầu xin sự bảo vệ từ Ngài.' Ngài phán: **'Họ cầu xin TA bảo vệ khỏi điều gì?'** Họ đáp: 'Khỏi Hỏa Ngục của Ngài, lạy Thượng Đế.' Ngài phán: **'Họ đã thấy Hỏa Ngục của TA chưa?'** Họ đáp: 'Chưa.' Ngài phán: **'Vậy sẽ ra sao nếu họ thấy được Hỏa Ngục của TA!'** Họ nói: 'Và họ cầu xin sự tha thứ từ Ngài.' Người (Nabi ﷺ) nói: 'Sau đó, Ngài phán: **'TA đã tha thứ cho họ, ban cho họ những gì họ cầu xin, và đã che chở họ khỏi những gì họ cầu xin sự bảo vệ.'** Người (Nabi ﷺ) nói: Họ nói: 'Lạy Thượng Đế, trong số họ có người kia, một bầy tôi phạm nhiều tội, chỉ tình cờ đi ngang qua và ngồi xuống cùng họ.' Người (Nabi ﷺ) nói: Và Ngài phán: **'Và cả y [nữa], TA cũng đã tha thứ: người ngồi cùng những người như vậy sẽ không phải chịu bất hạnh.'**'\nDo Muslim ghi lại (cũng như Al-Bukhari, At-Tirmidhi, và An-Nasa'i).",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 15,
			"arabicnumber": 15,
			"text": "Theo lời kể của Abu Hurayrah (cầu xin Allah hài lòng về họ), Nabi (ﷺ) nói: 'Allah Toàn Năng phán: **'TA đối đãi với bầy tôi của TA theo như niềm tin và kỳ vọng của y nơi TA¹. TA ở cùng y khi y tưởng nhớ đến TA. Nếu y tưởng nhớ đến TA trong lòng, TA sẽ tưởng nhớ đến y trong lòng TA; và nếu y tưởng nhớ đến TA trong một tập thể, TA sẽ tưởng nhớ đến y trong một tập thể còn tốt đẹp hơn. Nếu y đến gần TA một sải tay, TA sẽ đến gần y một thước; và nếu y đến gần TA một thước, TA sẽ đến gần y một sải cánh tay. Và nếu y đi bộ đến với TA, TA sẽ mau chóng đến với y.'**'\n(1) Ý nghĩa là sự tha thứ và chấp nhận sám hối của Đấng Toàn Năng phụ thuộc vào việc bầy tôi của Ngài thực sự tin rằng Ngài là Đấng Tha Thứ và Khoan Dung. Tuy nhiên, nếu niềm tin đó không đi kèm với hành động đúng đắn thì sẽ là một sự chế giễu Đấng Toàn Năng.\nDo Al-Bukhari ghi lại (cũng như Muslim, At-Tirmidhi và Ibn-Majah).",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 16,
			"arabicnumber": 16,
			"text": "Theo lời kể của con trai Abbas (cầu xin Allah hài lòng về cả hai), từ Thiên Sứ của Allah (ﷺ), trong số những lời Người truyền lại từ Thượng Đế của Người (Đấng Vinh Quang và Tối Cao), là Ngài nói: **'Allah đã ghi lại những việc tốt và việc xấu. Sau đó, Ngài đã giải thích rằng: ai có ý định làm một việc tốt nhưng chưa làm, Allah sẽ ghi cho y một việc tốt hoàn chỉnh ở nơi Ngài. Nhưng nếu y có ý định và đã làm, Allah sẽ ghi cho y từ mười đến bảy trăm lần, hoặc nhiều hơn nữa. Nhưng nếu y có ý định làm một việc xấu mà chưa làm, Allah sẽ ghi cho y một việc tốt hoàn chỉnh ở nơi Ngài. Nhưng nếu y có ý định và đã làm, Allah sẽ ghi đó là một việc xấu duy nhất.'**'\nDo Al-Bukhari và Muslim ghi lại.",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 17,
			"arabicnumber": 17,
			"text": "Theo lời kể của Abu Dharr al-Ghifari (cầu xin Allah hài lòng về họ), từ Nabi (ﷺ), trong số những lời Người truyền lại từ Thượng Đế của Người (cầu xin Ngài được tôn vinh), là Ngài nói: **'Hỡi các bầy tôi của TA, TA đã cấm sự bất công đối với chính TA và đã làm cho nó bị cấm giữa các ngươi, vậy đừng bất công với nhau. Hỡi các bầy tôi của TA, tất cả các ngươi đều lầm lạc ngoại trừ những ai TA đã hướng dẫn, vậy hãy cầu xin sự hướng dẫn từ TA, TA sẽ hướng dẫn các ngươi. Hỡi các bầy tôi của TA, tất cả các ngươi đều đói khát ngoại trừ những ai TA đã cho ăn, vậy hãy cầu xin thức ăn từ TA, TA sẽ cho các ngươi ăn. Hỡi các bầy tôi của TA, tất cả các ngươi đều trần trụi ngoại trừ những ai TA đã mặc cho, vậy hãy cầu xin y phục từ TA, TA sẽ mặc cho các ngươi. Hỡi các bầy tôi của TA, các ngươi phạm lỗi cả ngày lẫn đêm, và TA tha thứ mọi tội lỗi, vậy hãy cầu xin sự tha thứ từ TA, TA sẽ tha thứ cho các ngươi. Hỡi các bầy tôi của TA, các ngươi sẽ không bao giờ có thể làm hại đến TA để mà làm hại được TA, và cũng không bao giờ có thể làm lợi cho TA để mà làm lợi được cho TA. Hỡi các bầy tôi của TA, nếu người đầu tiên và người cuối cùng trong các ngươi, cả loài người và loài Jinn, đều ngoan đạo như trái tim của người ngoan đạo nhất trong số các ngươi, điều đó cũng không làm tăng thêm vương quốc của TA một chút nào. Hỡi các bầy tôi của TA, nếu người đầu tiên và người cuối cùng trong các ngươi, cả loài người và loài Jinn, đều gian ác như trái tim của kẻ gian ác nhất trong số các ngươi, điều đó cũng không làm giảm đi vương quốc của TA một chút nào. Hỡi các bầy tôi của TA, nếu người đầu tiên và người cuối cùng trong các ngươi, cả loài người và loài Jinn, cùng đứng tại một nơi và cầu xin TA, và TA ban cho mỗi người điều họ cầu xin, điều đó cũng không làm vơi đi những gì TA có, hơn việc một cây kim làm vơi đi nước biển khi được nhúng vào. Hỡi các bầy tôi của TA, đó chỉ là những việc làm của các ngươi mà TA ghi lại cho các ngươi rồi sẽ đền đáp, vậy ai tìm thấy điều tốt, hãy ca ngợi Allah, và ai tìm thấy điều khác, đừng trách ai ngoài chính bản thân mình.'**'\nDo Muslim ghi lại (cũng như At-Tirmidhi và Ibn Majah).",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 18,
			"arabicnumber": 18,
			"text": "Theo lời kể của Abu Hurayrah (cầu xin Allah hài lòng về họ), Thiên Sứ của Allah (ﷺ) nói: 'Allah (Đấng Quyền Năng và Tối Cao) sẽ phán vào Ngày Phán Xét: **'Hỡi con cháu Adam, TA đã lâm bệnh mà ngươi không đến thăm TA.'** Y sẽ nói: 'Lạy Thượng Đế, làm sao bề tôi có thể thăm Ngài khi Ngài là Thượng Đế của vũ trụ và vạn vật?' Ngài sẽ phán: **'Ngươi không biết rằng bầy tôi kia của TA đã lâm bệnh mà ngươi không đến thăm y sao? Ngươi không biết rằng nếu ngươi đến thăm y, ngươi đã tìm thấy TA ở bên cạnh y sao? Hỡi con cháu Adam, TA đã xin ngươi thức ăn mà ngươi không cho TA ăn.'** Y sẽ nói: 'Lạy Thượng Đế, làm sao bề tôi có thể cho Ngài ăn khi Ngài là Thượng Đế của vũ trụ và vạn vật?' Ngài sẽ phán: **'Ngươi không biết rằng bầy tôi kia của TA đã xin ngươi thức ăn mà ngươi không cho y ăn sao? Ngươi không biết rằng nếu ngươi cho y ăn, ngươi chắc chắn đã tìm thấy (phần thưởng cho việc đó) ở nơi TA sao? Hỡi con cháu Adam, TA đã xin ngươi nước uống mà ngươi không cho TA uống.'** Y sẽ nói: 'Lạy Thượng Đế, làm sao bề tôi có thể cho Ngài uống khi Ngài là Thượng Đế của vũ trụ và vạn vật?' Ngài sẽ phán: **'Bầy tôi kia của TA đã xin ngươi nước uống mà ngươi không cho y uống. Nếu ngươi cho y uống, ngươi chắc chắn đã tìm thấy điều đó ở nơi TA.'**'\nDo Muslim ghi lại.",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 19,
			"arabicnumber": 19,
			"text": "Theo lời kể của Abu Hurayrah (cầu xin Allah hài lòng về họ), Thiên Sứ của Allah (ﷺ) nói: 'Allah (Đấng Quyền Năng và Tối Cao) phán: **'Sự Kiêu Hãnh là áo choàng của TA và sự Vĩ Đại là tấm vải thắt lưng của TA, và ai tranh giành với TA một trong hai điều đó, TA sẽ ném y vào Hỏa Ngục.'**'\nDo Abu Dawud ghi lại (cũng như Ibn Majah và Ahmad) với những chuỗi truyền tin đáng tin cậy.",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 20,
			"arabicnumber": 20,
			"text": "Theo lời kể của Abu Hurayrah (cầu xin Allah hài lòng về họ), Thiên Sứ của Allah (ﷺ) nói: 'Các cánh cửa của Thiên Đàng được mở vào ngày thứ Hai và thứ Năm, và mọi bầy tôi [của Allah] không liên kết bất cứ điều gì với Allah đều được tha thứ, ngoại trừ một người có mối hằn thù với anh em của mình. [Về họ] sẽ có lời phán: **'Hãy hoãn lại hai người này cho đến khi họ hòa giải; hãy hoãn lại hai người này cho đến khi họ hòa giải.'**'\nDo Muslim ghi lại (cũng như Malik và Abu Dawud).",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 21,
			"arabicnumber": 21,
			"text": "Theo lời kể của Abu Hurayrah (cầu xin Allah hài lòng về họ), Thiên Sứ của Allah (ﷺ) nói rằng Allah Toàn Năng phán: **'Vào Ngày Phán Xét, có ba hạng người mà TA sẽ là đối thủ của họ: một người đã nhân danh TA thề thốt rồi bội ước; một người đã bán một người tự do rồi chiếm đoạt tiền bán được; và một người đã thuê một người làm, nhận đủ công sức từ y nhưng không trả công cho y.'**'\nDo Al-Bukhari ghi lại (cũng như Ibn Majah và Ahmad ibn Hanbal).",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 22,
			"arabicnumber": 22,
			"text": "Theo lời kể của Abu Sa'id (cầu xin Allah hài lòng về họ), Thiên Sứ của Allah (ﷺ) nói: 'Đừng ai trong các ngươi tự hạ thấp mình.' Họ hỏi: 'Lạy Thiên Sứ của Allah, làm sao một người trong chúng tôi lại tự hạ thấp mình?' Người phán: 'Y thấy một vấn đề liên quan đến Allah mà y phải lên tiếng, nhưng y lại không nói, thế là Allah (Đấng Quyền Năng và Tối Cao) sẽ phán với y vào Ngày Phán Xét: **'Điều gì đã ngăn cản ngươi nói về việc này việc kia?'** Y sẽ đáp: '[Đó là] vì sợ người đời.' Sau đó Ngài phán: **'Đáng lẽ ra ngươi phải kính sợ TA hơn mới phải.'**'\nDo Ibn Majah ghi lại với một chuỗi truyền tin đáng tin cậy.",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 23,
			"arabicnumber": 23,
			"text": "Theo lời kể của Abu Hurayrah (cầu xin Allah hài lòng về họ), Thiên Sứ của Allah (ﷺ) nói: 'Vào Ngày Phán Xét, Allah sẽ phán: **'Đâu là những người yêu thương nhau vì Vinh quang của TA? Hôm nay, TA sẽ che chở họ dưới bóng của TA, vào ngày không có bóng nào ngoài bóng của TA.'**'\nDo Al-Bukhari ghi lại (cũng như Malik).",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 24,
			"arabicnumber": 24,
			"text": "Theo lời kể của Abu Hurayrah (cầu xin Allah hài lòng về họ), Thiên Sứ của Allah (ﷺ) nói: 'Nếu Allah yêu thương một bầy tôi [của Ngài], Ngài gọi Jibril (as) và phán: **'TA yêu thương người kia, vậy ngươi hãy yêu thương y.'** Người (Nabi ﷺ) nói: 'Thế là Jibril yêu thương y. Sau đó, Jibril loan báo trên các tầng trời, nói rằng: **'Allah yêu thương người kia, vậy các ngươi hãy yêu thương y.'** Và cư dân trên trời yêu thương y. Người (Nabi ﷺ) nói: 'Sau đó, sự chấp nhận được thiết lập cho y trên Trái Đất. Và nếu Allah ghét một bầy tôi [của Ngài], Ngài gọi Jibril và phán: **'TA ghét người kia, vậy ngươi hãy ghét y.'** Thế là Jibril ghét y. Sau đó, Jibril loan báo cho cư dân trên trời: **'Allah ghét người kia, vậy các ngươi hãy ghét y.'** Người (Nabi ﷺ) nói: 'Thế là họ ghét y, và sự căm ghét được thiết lập cho y trên Trái Đất.'\nDo Muslim ghi lại (cũng như Al-Bukhari, Malik, và At-Tirmidhi).",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 25,
			"arabicnumber": 25,
			"text": "Theo lời kể của Abu Hurayrah (cầu xin Allah hài lòng về họ), Thiên Sứ của Allah (ﷺ) nói: 'Allah (Đấng Quyền Năng và Tối Cao) phán: **'Bất cứ ai tỏ thái độ thù địch với một người tận tụy với TA (Wali), TA sẽ tuyên chiến với y. Bầy tôi của TA không thể đến gần TA bằng bất cứ điều gì TA yêu thích hơn các nghĩa vụ tôn giáo mà TA đã quy định cho y, và bầy tôi của TA tiếp tục đến gần TA bằng các việc làm tự nguyện (nawafil) cho đến khi TA yêu thương y. Khi TA yêu thương y, TA là thính giác mà y dùng để nghe, là thị giác mà y dùng để nhìn, là bàn tay mà y dùng để hành động và là đôi chân mà y dùng để đi¹. Nếu y cầu xin [điều gì] ở TA, TA chắc chắn sẽ ban cho y, và nếu y cầu xin sự che chở từ TA, TA chắc chắn sẽ che chở cho y. TA không do dự về bất cứ điều gì như sự do dự của TA về việc [lấy đi] linh hồn của bầy tôi trung thành của TA: y ghét cái chết và TA ghét làm y tổn thương.'**'\n(1) Đây là một cách nói ẩn dụ, có nghĩa là Allah sẽ hướng dẫn và bảo vệ các giác quan và hành động của người đó, giúp họ chỉ nghe, nhìn và làm những điều tốt đẹp.\nDo Al-Bukhari ghi lại.",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 26,
			"arabicnumber": 26,
			"text": "Theo lời kể của Abu Umamah (cầu xin Allah hài lòng về họ), Thiên Sứ của Allah (ﷺ) nói: 'Allah (Đấng Quyền Năng và Tối Cao) phán: **'Quả thật, trong số những người tận tụy với TA mà TA ưu ái nhất là một tín đồ có phương tiện sống khiêm tốn, siêng năng cầu nguyện, đặc biệt chú tâm trong việc thờ phượng Thượng Đế của mình và đã vâng lời Ngài một cách kín đáo¹, người sống ẩn dật giữa mọi người và không được chú ý, và kế sinh nhai của y vừa đủ và y kiên nhẫn với điều đó.'** Sau đó, Nabi (ﷺ) búng tay và nói: 'Cái chết sẽ đến sớm với y, người khóc thương sẽ ít, di sản của y cũng ít ỏi.'\n(1) Tức là y không phô trương trong sự vâng lời của mình.\nDo At-Tirmidhi ghi lại (cũng như Ahmad ibn Hanbal và Ibn Majah). Chuỗi truyền tin của nó là đáng tin cậy.",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 27,
			"arabicnumber": 27,
			"text": "Theo lời kể của Masruq, họ nói: 'Chúng tôi đã hỏi Abdullah (tức Ibn Mas'ud) về câu Kinh này: *'Và chớ nghĩ rằng những người đã hy sinh vì chính nghĩa của Allah là đã chết, không, họ vẫn sống ở nơi Thượng Đế của họ, được cung dưỡng' (Qur'an 3:169).'* Ông đáp: 'Chúng tôi cũng đã hỏi về điều đó và Nabi (ﷺ) đã nói: **'Linh hồn của họ ở trong thân của những con chim màu xanh lục, có những chiếc đèn lồng treo trên Ngai Vàng, tự do bay lượn trong Thiên Đàng đến bất cứ nơi nào họ muốn, sau đó trú ngụ trong những chiếc đèn lồng đó. Rồi Thượng Đế của họ nhìn xuống họ và phán: 'Các ngươi có mong muốn điều gì không?' Họ đáp: 'Bầy tôi còn mong muốn điều gì nữa khi bầy tôi được tự do bay lượn trong Thiên Đàng đến bất cứ nơi nào bầy tôi muốn?' Và Ngài đã hỏi họ như vậy ba lần. Khi họ thấy rằng họ sẽ không được yên cho đến khi phải trả lời, họ nói: 'Lạy Thượng Đế, bầy tôi muốn Ngài trả lại linh hồn của bầy tôi vào thân xác của bầy tôi để bầy tôi có thể chiến đấu vì chính nghĩa của Ngài một lần nữa.' Và khi Ngài thấy rằng họ không còn nhu cầu nào nữa, họ được để yên.'**'\nDo Muslim ghi lại (cũng như At-Tirmidhi, An-Nasa'i và Ibn Majah).",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 28,
			"arabicnumber": 28,
			"text": "Theo lời kể của Jundub ibn Abdullah (cầu xin Allah hài lòng về họ), Thiên Sứ của Allah (ﷺ) nói: 'Trong số những người trước các ngươi, có một người đàn ông bị thương. Vì quá đau đớn, y đã lấy một con dao và tự cắt vào tay mình, máu không ngừng chảy cho đến khi y chết. Allah Toàn Năng phán: **'Bầy tôi của TA đã tự ý định đoạt mạng sống mình trước TA; TA đã cấm Thiên Đàng đối với y.'**'\nDo Al-Bukhari ghi lại.",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 29,
			"arabicnumber": 29,
			"text": "Theo lời kể của Abu Hurayrah (cầu xin Allah hài lòng về họ), Thiên Sứ của Allah (ﷺ) nói: 'Allah (Đấng Quyền Năng và Tối Cao) phán: **'Phần thưởng của TA dành cho bầy tôi trung thành của TA, nếu TA lấy đi người bạn thân nhất của y từ cõi trần này và y kiên nhẫn chịu đựng vì TA, sẽ không gì khác ngoài Thiên Đàng.'**'\nDo Al-Bukhari ghi lại.",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 30,
			"arabicnumber": 30,
			"text": "Theo lời kể của Abu Hurayrah (cầu xin Allah hài lòng về họ), Thiên Sứ của Allah (ﷺ) nói: 'Allah (Đấng Quyền Năng và Tối Cao) phán: **'Nếu bầy tôi của TA thích gặp TA, TA cũng thích gặp y; và nếu y không thích gặp TA, TA cũng không thích gặp y.'**' Lời giải thích của Nabi về Hadith Thánh Ngôn này: 'Ai thích gặp Allah, Allah thích gặp người đó; và ai không thích gặp Allah, Allah cũng không thích gặp người đó.' Aishah (cầu xin Allah hài lòng về họ) hỏi: 'Lạy Nabi của Allah, có phải là vì không thích cái chết không, vì tất cả chúng ta đều không thích cái chết?' Nabi (ﷺ) phán: 'Không phải vậy, mà là khi người tín đồ được báo tin vui về Lòng thương xót của Allah, sự hài lòng của Ngài và Thiên Đàng của Ngài, y sẽ thích gặp Allah và Allah cũng thích gặp y; nhưng khi kẻ vô đức tin bị báo tin về sự trừng phạt và sự không hài lòng của Allah, y sẽ không thích gặp Allah và Allah cũng không thích gặp y.'\nDo Al-Bukhari và Malik ghi lại. Phiên bản của Nabi do Muslim ghi lại.",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 31,
			"arabicnumber": 31,
			"text": "Theo lời kể của Jundub (cầu xin Allah hài lòng về họ), Thiên Sứ của Allah (ﷺ) đã kể lại: 'Một người đàn ông nói: 'Thề với Allah, Allah sẽ không tha thứ cho người kia đâu.' Nghe vậy, Allah Toàn Năng phán: **'Kẻ nào dám nhân danh TA mà thề rằng TA sẽ không tha thứ cho người kia? Quả thật, TA đã tha thứ cho người kia và đã hủy bỏ những việc [tốt] của ngươi¹.'**'\n(1) Một Hadith tương tự cho thấy người nói câu này là một người ngoan đạo, nhưng những việc tốt trước đó của y đã bị hủy bỏ do sự kiêu ngạo khi cho rằng mình có quyền tuyên bố Allah sẽ không tha thứ cho ai.\nDo Muslim ghi lại.",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 32,
			"arabicnumber": 32,
			"text": "Theo lời kể của Abu Hurayrah (cầu xin Allah hài lòng về họ), Thiên Sứ của Allah (ﷺ) nói: 'Một người đàn ông đã phạm nhiều tội lỗi. Khi cái chết đến gần, y dặn dò các con trai mình rằng: 'Khi cha chết, hãy thiêu xác cha, rồi nghiền thành tro và rắc xuống biển, vì thề với Allah, nếu Thượng Đế của cha bắt được cha, Ngài chắc chắn sẽ trừng phạt cha một cách chưa từng trừng phạt ai.' Họ đã làm theo lời y. Sau đó, Allah phán với mặt đất: **'Hãy trả lại những gì ngươi đã lấy'** – và kìa, y đang đứng đó! Ngài phán với y: **'Điều gì đã khiến ngươi làm như vậy?'** Y đáp: 'Vì lòng kính sợ Ngài, lạy Thượng Đế của bề tôi' (hoặc y nói: 'Vì sự sợ hãi Ngài') và vì điều đó, Ngài đã tha thứ cho y.'\nDo Muslim ghi lại (cũng như Al-Bukhari, An-Nasa'i và Ibn Majah).",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 33,
			"arabicnumber": 33,
			"text": "Theo lời kể của Abu Hurayrah (cầu xin Allah hài lòng về họ), từ Nabi (ﷺ), trong những gì Người truyền lại từ Thượng Đế của Người (Đấng Quyền Năng và Tối Cao), là Ngài nói: **'Một bầy tôi [của Allah] phạm một tội lỗi và nói: 'Lạy Allah, xin hãy tha thứ cho tội lỗi của bề tôi.' Và Ngài (Đấng Vinh Quang và Tối Cao) phán: 'Bầy tôi của TA đã phạm một tội lỗi và đã biết rằng y có một Thượng Đế, Đấng tha thứ cho tội lỗi và cũng trừng phạt vì nó.' Sau đó, y lại phạm tội và nói: 'Lạy Thượng Đế, xin hãy tha thứ cho tội lỗi của bề tôi.' Và Ngài phán: 'Bầy tôi của TA đã phạm một tội lỗi và đã biết rằng y có một Thượng Đế, Đấng tha thứ cho tội lỗi và cũng trừng phạt vì nó.' Sau đó, y lại phạm tội và nói: 'Lạy Thượng Đế, xin hãy tha thứ cho tội lỗi của bề tôi.' Và Ngài phán: 'Bầy tôi của TA đã phạm một tội lỗi và đã biết rằng y có một Thượng Đế, Đấng tha thứ cho tội lỗi và cũng trừng phạt vì tội lỗi. Hãy làm những gì ngươi muốn, vì TA đã tha thứ cho ngươi.'**'\nDo Muslim ghi lại (cũng như Al-Bukhari).",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 34,
			"arabicnumber": 34,
			"text": "Theo lời kể của Anas (cầu xin Allah hài lòng về họ), họ nói: Tôi đã nghe Thiên Sứ của Allah (ﷺ) nói: 'Allah Toàn Năng phán: **'Hỡi con cháu Adam, chừng nào ngươi còn cầu nguyện TA và cầu xin TA, TA sẽ tha thứ cho ngươi về những gì ngươi đã làm, và TA không bận tâm. Hỡi con cháu Adam, nếu tội lỗi của ngươi cao đến tận mây trời, rồi ngươi cầu xin TA tha thứ, TA sẽ tha thứ cho ngươi. Hỡi con cháu Adam, nếu ngươi đến với TA với tội lỗi gần đầy cả Trái Đất, rồi ngươi gặp TA mà không liên kết bất kỳ đối tác nào với TA, TA sẽ đến với ngươi với sự tha thứ gần đầy cả Trái Đất.'**'\nDo At-Tirmidhi ghi lại (cũng như Ahmad ibn Hanbal). Chuỗi truyền tin của nó là đáng tin cậy.",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 35,
			"arabicnumber": 35,
			"text": "Theo lời kể của Abu Hurayrah (cầu xin Allah hài lòng về họ), Thiên Sứ của Allah (ﷺ) nói: 'Thượng Đế của chúng ta (Đấng Vinh Quang và Tối Cao) giáng xuống tầng trời thấp nhất vào mỗi đêm khi một phần ba cuối cùng của đêm còn lại, và Ngài phán: **'Ai đang cầu nguyện TA để TA đáp lời? Ai đang cầu xin TA điều gì để TA ban cho? Ai đang cầu xin sự tha thứ từ TA để TA tha thứ cho?'**'\nDo Al-Bukhari ghi lại (cũng như Muslim, Malik, At-Tirmidhi và Abu Dawud). Trong một phiên bản của Muslim, Hadith kết thúc bằng: 'Và Ngài cứ như vậy cho đến khi [ánh sáng] bình minh ló dạng.'",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 36,
			"arabicnumber": 36,
			"text": "Theo lời kể của Anas (cầu xin Allah hài lòng về họ), từ Nabi (ﷺ), Người nói: 'Những người có đức tin sẽ tập hợp vào Ngày Phán Xét và nói: 'Chúng ta có nên cầu xin [ai đó] can thiệp cho chúng ta trước Thượng Đế của chúng ta không?' Họ sẽ đến gặp Adam và nói: 'Ngài là Cha của nhân loại; Allah đã tạo ra Ngài bằng Bàn Tay của Ngài, đã khiến các Thiên Thần của Ngài quỳ lạy Ngài và đã dạy Ngài tên của mọi thứ, vậy xin hãy can thiệp cho chúng tôi trước Thượng Đế của Ngài để Ngài giải thoát chúng tôi khỏi nơi này.' Ông sẽ nói: 'Tôi không ở vị thế [để làm điều đó]' – và ông sẽ nhớ lại lỗi lầm của mình và cảm thấy xấu hổ và nói: 'Hãy đến gặp Nuh, vì ông là Thiên Sứ đầu tiên mà Allah đã cử đến cho cư dân Trái Đất.' Họ sẽ đến gặp ông và ông sẽ nói: 'Tôi không ở vị thế [để làm điều đó]' – và ông sẽ nhớ lại việc mình đã cầu xin Thượng Đế điều mà ông không có kiến thức, và ông sẽ cảm thấy xấu hổ và nói: 'Hãy đến gặp Người Bạn của Đấng Khoan Dung (Abraham).' Họ sẽ đến gặp ông và ông sẽ nói: 'Tôi không ở vị thế [để làm điều đó]. Hãy đến gặp Musa, một bầy tôi mà Allah đã nói chuyện và đã ban cho Kinh Tawrah.' Họ sẽ đến gặp ông và ông sẽ nói: 'Tôi không ở vị thế [để làm điều đó]' – và ông sẽ nhớ lại việc đã tước đi một mạng sống, và ông sẽ cảm thấy xấu hổ trước Thượng Đế của mình và nói: 'Hãy đến gặp 'Isa, bầy tôi và Thiên Sứ của Allah, Lời phán và Linh hồn từ Allah.' Họ sẽ đến gặp ông và ông sẽ nói: 'Tôi không ở vị thế [để làm điều đó]. Hãy đến gặp Muhammad (ﷺ), một bầy tôi mà Allah đã tha thứ mọi lỗi lầm, quá khứ và tương lai.' Họ sẽ đến gặp tôi và tôi sẽ xin phép đến gặp Thượng Đế của tôi, và sự cho phép sẽ được ban. Khi tôi nhìn thấy Thượng Đế của tôi, tôi sẽ phủ phục quỳ lạy. Ngài sẽ để tôi như vậy chừng nào Ngài muốn, sau đó sẽ có lời phán: **'Hãy ngẩng đầu lên. Hãy cầu xin, ngươi sẽ được ban. Hãy nói, lời ngươi sẽ được nghe. Hãy can thiệp, sự can thiệp của ngươi sẽ được chấp nhận.'** Tôi sẽ ngẩng đầu lên và ca ngợi Ngài bằng những lời ca ngợi mà Ngài sẽ dạy cho tôi. Sau đó, tôi sẽ can thiệp và Ngài sẽ đặt ra một giới hạn [về số người], và tôi sẽ đưa họ vào Thiên Đàng. Sau đó, tôi sẽ quay lại với Ngài, và khi tôi nhìn thấy Thượng Đế của tôi, [tôi sẽ quỳ lạy] như trước. Sau đó, tôi sẽ can thiệp và Ngài sẽ đặt ra một giới hạn [về số người], và tôi sẽ đưa họ vào Thiên Đàng. Sau đó, tôi sẽ quay lại lần thứ ba, rồi lần thứ tư, và tôi sẽ nói: 'Không còn ai trong Hỏa Ngục ngoại trừ những người bị Kinh Qur'an giam giữ và phải ở đó vĩnh viễn.' Sẽ ra khỏi Hỏa Ngục người nào nói: 'Không có thượng đế nào ngoài Allah' và trong tim có điều tốt lành nặng bằng một hạt lúa mạch; rồi sẽ ra khỏi Hỏa Ngục người nào nói: 'Không có thượng đế nào ngoài Allah' và trong tim có điều tốt lành nặng bằng một hạt lúa mì; rồi sẽ ra khỏi Hỏa Ngục người nào nói: 'Không có thượng đế nào ngoài Allah' và trong tim có điều tốt lành nặng bằng một nguyên tử.'\nDo Al-Bukhari ghi lại (cũng như Muslim, At-Tirmidhi, và Ibn Majah).",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 37,
			"arabicnumber": 37,
			"text": "Theo lời kể của Abu Hurayrah (cầu xin Allah hài lòng về họ), Thiên Sứ của Allah (ﷺ) nói: 'Allah phán: **'TA đã chuẩn bị cho những bầy tôi ngoan đạo của TA những gì mắt chưa từng thấy, tai chưa từng nghe, và lòng người chưa từng tưởng tượng đến.'** Vậy hãy đọc nếu các ngươi muốn: *'Và không một linh hồn nào biết được niềm vui nào đã được giữ kín cho họ (cư dân Thiên Đàng)' (Qur'an 32:17).'*'\nDo Al-Bukhari, Muslim, At-Tirmidhi và Ibn Majah ghi lại.",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 38,
			"arabicnumber": 38,
			"text": "Theo lời kể của Abu Hurayrah (cầu xin Allah hài lòng về họ), Thiên Sứ của Allah (ﷺ) nói: 'Khi Allah tạo ra Thiên Đàng và Hỏa Ngục, Ngài đã cử Jibril đến Thiên Đàng, phán: **'Hãy nhìn vào nó và những gì TA đã chuẩn bị cho cư dân của nó.'** Nabi (ﷺ) nói: 'Thế là Jibril đến đó, nhìn vào nó và những gì Allah đã chuẩn bị cho cư dân của nó.' Nabi (ﷺ) nói: 'Jibril quay lại và nói: 'Thề với Uy quyền của Ngài, không ai nghe về nó mà không vào đó.' Thế là Ngài ra lệnh cho nó được bao bọc bởi những điều gian khó¹, và Ngài phán: **'Hãy quay lại đó và nhìn vào những gì TA đã chuẩn bị cho cư dân của nó.'** Nabi (ﷺ) nói: 'Thế là Jibril quay lại đó và thấy rằng nó đã được bao bọc bởi những điều gian khó.' Sau đó, Jibril quay lại và nói: 'Thề với Uy quyền của Ngài, bề tôi sợ rằng sẽ không có ai vào được đó.' Ngài phán: **'Hãy đến Hỏa Ngục và nhìn vào nó và những gì TA đã chuẩn bị cho cư dân của nó,'** và Jibril thấy nó đang cuồn cuộn chồng chất lên nhau. Sau đó, Jibril quay lại và nói: 'Thề với Uy quyền của Ngài, không ai nghe về nó mà sẽ vào đó.' Thế là Ngài ra lệnh cho nó được bao bọc bởi những dục vọng. Rồi Ngài phán: **'Hãy quay lại đó.'** Và Jibril quay lại đó và nói: 'Thề với Uy quyền của Ngài, bề tôi lo sợ rằng sẽ không ai thoát khỏi việc vào đó.''\n(1) Từ được dùng ở đây là 'makarih', nghĩa đen là 'những điều không được ưa thích'. Trong ngữ cảnh này, nó chỉ các hình thức kỷ luật tôn giáo mà con người thường thấy nặng nề, khó khăn.\nDo Tirmidhi ghi lại, và nói rằng đây là một Hadith tốt và đáng tin cậy (cũng như Abu Dawud và An-Nasa'i).",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 39,
			"arabicnumber": 39,
			"text": "Theo lời kể của Abu Sa'id al-Khudri (cầu xin Allah hài lòng về họ), Thiên Sứ của Allah (ﷺ) nói: 'Thiên Đàng và Hỏa Ngục tranh luận với nhau, và Hỏa Ngục nói: 'Trong ta là những kẻ hùng mạnh và kiêu ngạo.' Thiên Đàng nói: 'Trong ta là những người yếu thế và nghèo khó.' Thế là Allah phán xét giữa chúng, [nói rằng]: **'Ngươi, Thiên Đàng, là Lòng Thương Xót của TA; qua ngươi TA thể hiện lòng thương xót đến những ai TA muốn. Và ngươi, Hỏa Ngục, là Sự Trừng Phạt của TA; qua ngươi TA trừng phạt những ai TA muốn, và TA có trách nhiệm rằng mỗi ngươi sẽ được lấp đầy.'**'\nDo Muslim ghi lại (cũng như Al-Bukhari và At-Tirmidhi).",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 40,
			"arabicnumber": 40,
			"text": "Theo lời kể của Abu Sa'id al-Khudri (cầu xin Allah hài lòng về họ), Thiên Sứ của Allah (ﷺ) nói: 'Allah sẽ phán với cư dân Thiên Đàng: **'Hỡi cư dân Thiên Đàng!'** Họ sẽ đáp: 'Lạy Thượng Đế của bầy tôi, bầy tôi xin có mặt và sẵn lòng phục vụ Ngài, và mọi điều tốt lành đều ở trong Tay Ngài.' Sau đó Ngài sẽ phán: **'Các ngươi đã hài lòng chưa?'** Và họ sẽ đáp: 'Và làm sao bầy tôi lại không hài lòng, lạy Thượng Đế, khi Ngài đã ban cho bầy tôi những gì Ngài chưa từng ban cho bất kỳ ai khác trong tạo vật của Ngài.' Sau đó Ngài sẽ phán: **'Các ngươi có muốn TA ban cho các ngươi điều gì tốt đẹp hơn thế không?'** Và họ sẽ hỏi: 'Lạy Thượng Đế, và điều gì có thể tốt đẹp hơn thế?' Và Ngài sẽ phán: **'TA sẽ ban Sự Hài Lòng của TA xuống cho các ngươi và sau này sẽ không bao giờ không hài lòng với các ngươi nữa.'**'\nDo Al-Bukhari ghi lại (cũng như Muslim và At-Tirmidhi).",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 40
			}
		}
	]
}
